# Equals Method (ThermalAsset)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset..::..Equals Method (ThermalAsset)
ThermalAsset Class See Also
---
Determines whether this thermal asset is equal to another.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool Equals(
	ThermalAsset other
)
```

Visual Basic
---
```text
Public Function Equals ( _
	other As ThermalAsset _
) As Boolean
```

Visual C++
---
```text
public:
bool Equals(
	ThermalAsset^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ThermalAsset The thermal asset to compare with this one.
# ### Return Value
True if the given thermal asset is equal to this one, otherwise false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ThermalAsset Class
Equals Overload
Autodesk.Revit.DB Namespace